using System;
using TaxInspection.Database_elements;

namespace TaxInspection.Extensions
{
    public static class DataGenerator
    {
        private static Random _random = new Random();

        private static string[] _personNames = { "Августин", "Аврелій", "Арсен", "Борис", "Богдан", "Владислав", "Володимир", "Артемій", "Валентин", 
            "Валерій", "Віталій", "Всеволод", "Григорій", "Георгій", "Данило", "Денис", "Давид", "Євген", "Захар", "Зиновій", "Ігор", "Іван",
        "Кирил", "Лев", "Леонід", "Лука", "Марко", "Нестор", "Олег", "Олександр", "Павло", "Петро", "Роман", "Руслан", "Сергій"};

        private static string[] _personSurnames = { "Мельник", "Шевченко", "Бойко", "Коваленко", "Ковальчук", "Бондаренко", "Шевчук", "Мороз", "Лисенко",
        "Савченко", "Олійник", "Руденко", "Поліщук", "Ткач", "Іванок", "Семенюк", "Семченко", "Тищишин", "Руданко", "Федоренко", "Бабенко", "Попович",
        "Тимошенко", "Литвин", "Онищенко", "Борисенко", "Гавриленко", "Музика", "Зозуля"};

    }
}
